"""
윤년이랑 1년이 365일이 아니라 366일로 계산되는 해를 말합니다
윤년은 현실과 달력의 차이를 없애기 위해 다음과 같은 규칙으로 계산됩니다

-4의 배수는 윤년입니다
-100의 배수는 윤년이 아닙니다 (4의 배수여도 상관없습니다)
-400의 배수는 윤년이니다 (4, 10의 배수여부와 관계없습니다)
"""

#4의배수 그리고 400의 배수는 윤년이다 == true
#100의 배수는 윤년이 아니다 == false

#year=365
#leap_year4= 365%4==0
#leap_year400= 365%400==0
#leap_year100= 365%100!=0
#print(leap_year4)
#print(leap_year400)
#print(leap_year100)

year = 2025

#leap= 4의배수이면서 100의배수는 아니고 400의배수여야한다 -> 의사코드
#leap = 4의배수 and 100의배수아님 or 400의배수
is4= year%4==0
not100 = year%100 !=0
is400 = year%400==0
print(is4, not100, is400)


leap= is4 and not100 or is400


print('윤년인가?' ,leap)



